PhosphorosVR/OpenIris-ESPIDF/components/esp32-camera/target/xclk.c
#include "driver/gpio.h"
#include "driver/ledc.h"
#include "esp_err.h"
#include "esp_log.h"
#include "esp_system.h"
#include "xclk.h"
#include "esp_camera.h"

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#else
#include "esp_log.h"
static const char* TAG = "camera_xclk";
#endif

#define NO_CAMERA_LEDC_CHANNEL 0xFF
static ledc_channel_t g_ledc_channel = NO_CAMERA_LEDC_CHANNEL;

esp_err_t xclk_timer_conf(int ledc_timer, int xclk_freq_hz)
{
    ledc_timer_config_t timer_conf;
    timer_conf.duty_resolution = LEDC_TIMER_1_BIT;
    timer_conf.freq_hz = xclk_freq_hz;
    timer_conf.speed_mode = LEDC_LOW_SPEED_MODE;

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 0)
    timer_conf.deconfigure = false;
#endif

#if ESP_IDF_VERSION_MAJOR >= 4
    // Fix B: If the target XCLK is reachable via an exact integer divider
    // from the 40 MHz XTAL, use XTAL as the LEDC source. XTAL is crystal-clean
    // and independent of the CPU PLL, which makes XCLK jitter significantly
    // lower than when sourced from APB (APB = CPU-PLL/2, which carries PLL
    // phase noise along with it). For frequencies without an integer divider
    // from XTAL (e.g. 27 MHz) we stay on LEDC_AUTO_CLK so the driver can pick
    // APB automatically.
    const uint32_t xtal_hz = 40000000u;
    const uint32_t src_ticks_per_period = (uint32_t)xclk_freq_hz * 2u; // 1-bit duty = 2 Ticks/Periode
    if (xclk_freq_hz > 0 && src_ticks_per_period > 0
        && (xtal_hz % src_ticks_per_period) == 0
        && (xtal_hz / src_ticks_per_period) >= 1) {
        timer_conf.clk_cfg = LEDC_USE_XTAL_CLK;
        ESP_LOGI(TAG, "XCLK %d Hz sourced from XTAL (clean integer divider)", xclk_freq_hz);
    } else {
        timer_conf.clk_cfg = LEDC_AUTO_CLK;
        ESP_LOGW(TAG, "XCLK %d Hz not integer-divisible from XTAL; falling back to AUTO (fractional divider jitter possible)", xclk_freq_hz);
    }
#endif
    timer_conf.timer_num = (ledc_timer_t)ledc_timer;
    esp_err_t err = ledc_timer_config(&timer_conf);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "ledc_timer_config failed for freq %d, rc=%x", xclk_freq_hz, err);
    }
    return err;
}

esp_err_t camera_enable_out_clock(const camera_config_t* config)
{
    esp_err_t err = xclk_timer_conf(config->ledc_timer, config->xclk_freq_hz);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "ledc_timer_config failed, rc=%x", err);
        return err;
    }

    g_ledc_channel = config->ledc_channel;
    ledc_channel_config_t ch_conf = {0};
    ch_conf.gpio_num = config->pin_xclk;
    ch_conf.speed_mode = LEDC_LOW_SPEED_MODE;
    ch_conf.channel = config->ledc_channel;
    ch_conf.intr_type = LEDC_INTR_DISABLE;
    ch_conf.timer_sel = config->ledc_timer;
    ch_conf.duty = 1;
    ch_conf.hpoint = 0;
    err = ledc_channel_config(&ch_conf);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "ledc_channel_config failed, rc=%x", err);
        return err;
    }
    return ESP_OK;
}

void camera_disable_out_clock()
{
    if (g_ledc_channel != NO_CAMERA_LEDC_CHANNEL) {
        ledc_stop(LEDC_LOW_SPEED_MODE, g_ledc_channel, 0);
        g_ledc_channel = NO_CAMERA_LEDC_CHANNEL;
    }
}
